the
of
given
return
a
is
and
in
an
to
that
are
you
if
array
integer
number
where
be
it
each
can
all
for
n
1
with
two
from
or
any
there
0
one
at
not
by
such
string
as
integers
order
have
on
example
following
length
nums
-
i
same
no
this
x
has
will
0-indexed
only
minimum
note
may
maximum
2
value
k
ith
after
answer
sum
than
possible
equal
s
some
its
which
between
elements
then
should
must
true
first
every
binary
also
otherwise
we
positive
more
find
characters
so
-1
strings
represents
into
left
exactly
values
list
false
3
other
right
element
m
them
nodes
tree
index
empty
your
times
contains
both
least
size
most
ie
int
time
2d
j
row
different
they
make
representing
node
valid
numbers
b
choose
sequence
multiple
when
their
exists
letters
character
either
words
result
root
7
write
unique
does
operation
arrays
represented
column
do
once
matrix
sorted
smallest
distinct
non-empty
query
move
indices
three
consisting
another
type
cannot
consists
digits
grid
want
adjacent
total
position
initially
key
class
operations
returns
format
contiguous
numsi
implement
arr
using
without
within
less
name
indicates
large
since
these
starting
109
new
range
largest
modulo
4
defined
but
start
need
5
path
contain
set
last
considered
c
lowercase
table
containing
next
take
object
greater
substring
pair
generated
initializes
before
second
cell
target
even
above
inclusive
subarray
denotes
end
remaining
remove
form
original
difference
function
primary
letter
schema
sql
single
word
y
called
guaranteed
numbered
edges
longest
up
edge
english
get
means
respectively
until
use
conditions
consecutive
allowed
connected
test
strictly
input
rules
cells
non-negative
digit
point
id
moves
labeled
change
current
cases
pairs
reach
however
leading
subsequence
while
because
needed
points
always
follows
exist
score
add
product
design
answers
space
6
assume
step
numsj
distance
was
ai
four
starts
could
steps
group
formed
deleting
graph
used
top
appear
day
perform
positions
void
amount
replace
9
way
bi
10
would
possibly
very
t
game
returned
num
represent
case
down
queries
square
answeri
edgesi
changing
formally
data
1s
resulting
many
nums1
zero
notice
who
increasing
ascending
xi
undirected
varchar
rows
whose
becomes
absolute
person
algorithm
numslength
ways
present
part
linked
d
zeros
appears
takes
substrings
below
output
jth
pick
lexicographically
structure
0s
place
ends
head
delete
been
impossible
itself
previous
smaller
still
final
required
task
turn
nums2
line
about
8
non-decreasing
through
yi
arri
r
removing
like
including
solution
count
common
null
direction
odd
complete
initial
performing
call
made
swap
directly
split
children
among
how
moving
good
subarrays
alice
corresponding
consider
process
cost
separated
val
accepted
shortest
none
price
32-bit
go
determine
chosen
types
search
according
let
height
report
information
kth
bottom
decimal
ordered
representation
z
except
palindrome
applying
too
groups
become
along
color
reverse
divisible
divide
out
being
satisfies
spaces
convert
placed
problem
permutation
people
level
----------------------
city
whether
equals
actual
removed
define
already
alphabet
goal
bob
1-indexed
date
written
wants
boolean
coordinates
average
infinite
optimally
apply
highest
abc
solve
p
ab
shown
entire
occurs
occurrences
ones
uppercase
area
long
plane
playing
code
days
queriesi
child
prefix
lengths
leaf
currently
negative
occurrence
paths
during
board
obtain
keys
minutes
turns
were
pass
obtained
derived
over
parent
added
sort
water
simultaneously
subsequences
play
player
those
insert
parentheses
l
special
third
traversal
repeat
interval
system
lower
necessarily
trees
never
u
ans
bitwise
together
si
complexity
back
seconds
construct
subset
travel
squares
check
connecting
10-5
user
outside
beginning
duplicate
100
taken
lists
know
duplicates
described
suppose
tie
names
select
customer
needs
forward
players
money
arranged
lowest
fit
corner
concatenation
unit
e
build
concatenated
said
o
choosing
side
instead
just
rearrange
relative
he
front
changed
leftmost
columns
directions
calls
built-in
item
stones
frequency
visit
correct
see
extra
subtree
functions
11
calculate
satisfy
employee
visited
xor
flip
ansi
bits
twice
s2
s1
rectangle
rotate
replacing
map
put
partition
based
larger
results
maximize
starti
endi
consist
east
addition
please
bottom-right
inside
found
describes
constraints
------------------------
assigned
again
invalid
vertical
mat
available
width
n-1
road
meaning
standing
under
ids
receive
bit
fewer
signed
greatest
several
mentioned
adding
adds
text
arr1
top-left
filled
create
followed
v
students
assign
stop
located
denote
prices
maximized
done
full
rounded
closest
follow
divided
arrj
continue
ui
vi
random
passed
floor
per
occur
method
arrlength
colors
student
modify
location
items
power
properties
1st
places
upper
nth
denoting
bst
coordinate
stone
nums0
units
certain
minute
expression
weight
finish
sentence
longer
12
subtract
minimized
pattern
buy
costs
fits
rotation
might
exceed
state
nums1i
land
4-directionally
backward
achieve
horizontal
prime
rest
gets
employees
stops
division
divisor
pointsi
assuming
numsk
repeated
append
depth
similarly
immediately
reads
friends
fn
modified
col
run
clockwise
match
wordsi
leave
increment
ending
specific
non-overlapping
circular
merge
customers
calculated
his
removes
box
remains
increase
x-axis
west
vertices
wins
arr0
trailing
wall
network
users
counted
differ
palindromic
meets
include
friend
middle
deleted
rearranging
sign
cover
store
reaches
ri
rightmost
walk
minimize
version
diagonal
intervals
moment
round
ordering
keep
x1
north
south
nearest
around
-----------------------
vertically
higher
123
company
applied
sums
file
additional
replaced
dictionary
asked
encoded
room
covered
now
share
repeating
events
event
seats
inserted
runs
neighbors
going
permutations
condition
instance
destination
wait
onto
sequences
jump
directed
h
win
rule
foreign
o1
concatenating
examples
denoted
alternating
inputs
3rd
2nd
limit
cities
scores
performed
hold
gridij
created
rooted
cycles
making
f
included
well
latest
white
sell
holds
begin
center
our
13
additionally
base
seat
probability
inserts
belongs
red
lefti
constructed
changes
salary
pile
piles
2n
stream
horizontally
blue
colored
rotated
program
pointer
circle
zeroes
request
building
plus
continuous
high
robot
leaves
etc
queue
solutions
having
speed
rectangular
degrees
image
matches
transform
w
non-zero
open
orders
specifically
card
pay
randomly
singly
righti
word2
word1
boxes
earliest
pricei
x2
overlap
x-y
stack
products
due
shows
-------------------
what
supports
constant
played
off
meet
bidirectional
accepts
transactions
lexicographical
subtrees
userid
mark
series
nothing
completely
-x
25
tasks
flips
she
associated
hand
five
1000
belong
requirements
26
0th
serialization
similar
bank
much
candies
free
segment
stock
say
course
intersection
reorder
traveling
dollars
insertion
identical
later
capacity
axis-aligned
y1
top-right
a2
rank
swapping
winner
decide
notes
low
work
car
arithmetic
heights
year
triplets
nums2i
uses
had
leetcode
started
stay
received
placing
piece
slength
num2
num1
sorting
ranges
implementation
cards
enter
subsets
decreasing
modifying
deletion
manner
sets
support
lets
90
rearranged
swaps
abcde
coins
pieces
mapping
grouped
timei
comes
read
rotating
bool
block
profit
pricesi
indicate
hours
rounds
collect
remain
earlier
parts
beautiful
arr2
bottom-left
rectangles
house
push
arbitrary
a1
indicating
satisfied
break
themselves
vertex
update
across
reversed
operator
taking
arrarrlength
makes
choice
numsi1
period
hour
suffix
figure
15
subsequent
shift
vice
versa
answerlength
weights
overlapping
decided
language
roads
anywhere
stored
half
multiply
composed
memory
labels
combination
concatenate
message
in-place
recall
happens
significant
queriesj
courses
sold
costi
segments
cycle
black
future
whole
intervalsi
video
come
indexed
checks
double
amongst
brackets
own
distribute
231
ancestor
descendant
arrive
parallel
houses
alices
frequent
pop
particular
enum
running
shape
weighted
happy
chooses
decrease
balanced
regardless
picked
obstacle
tasked
finally
evaluate
radius
garden
help
forms
requests
server
strs
chessboard
descending
label
4th
source
sides
provided
abcd
formatted
divides
tasksi
andor
factor
tile
previously
expressions
cut
island
repeatedly
give
olog
1th
public
testcases
g
absx
nums2j
cardinal
boundary
manager
team
bag
draw
movement
blocks
intersect
divisors
mean
hhmm
logs
sit
food
methods
occupied
surrounded
inserting
321
definition
selected
y2
street
stonesi
earn
pushes
triangle
record
missing
toi
fromi
ensure
productid
fixed
closed
world
trying
best
preorder
doing
explanation
21
20
vowel
combinations
copy
far
disjoint
fully
equivalent
anagram
independent
multiplication
operators
able
querieslength
underlined
factors
contained
thus
marked
judge
equally
country
increases
parents
necessary
balls
towards
c1
lie
li
loses
converted
broken
opposite
101
obstacles
ignored
arrk
excluding
maximal
individually
evaluates
weighti
field
kind
collection
01
print
sequentially
forming
roots
replacement
subtraction
symbol
goes
here
ci
rooms
persons
perfect
candy
small
endpoints
transaction
lines
separate
counts
finished
reset
completed
rating
perimeter
q
wikipedia
descendants
satisfying
met
waiting
hi
0000
132
stores
absi
non-increasing
timestamp
-------------------------
website
cols
facing
visits
reports
us
handle
generates
reachable
lose
22
answer0
answer1
else
flipping
-3
executed
threads
centered
generate
trip
drop
transformation
differs
alternate
30
calendar
pivot
social
tiles
corresponds
exact
vowels
servers
nor
content
compute
encoding
typed
real
eat
jumps
aa
reference
doesnt
fall
falls
ball
simple
fourth
23
reached
passes
did
returning
variable
counterclockwise
exam
others
idi
evenly
sitting
her
positioned
allows
age
uj
vj
runtime
access
addint
multiplied
nodeval
affect
calling
accounts
competition
various
formula
sizes
removal
instances
50
minimal
ace
existing
spend
counting
downward
median
decode
allocate
maps
60
duration
numeric
locations
answerj
address
border
library
away
shop
job
huge
straight
property
log
treat
painted
station
computed
teams
repeats
lead
allow
valuesi
workers
worker
bus
arrives
arrival
16
writing
percentage
freely
pilesi
pushint
partitions
varying
wrong
updates
beauty
diagonally
department
secret
decoded
bi-directional
quantity
customerid
moved
guess
procedure
partitioned
fill
constructor
continues
sentences
thread
tests
tokens
cars
enough
prerequisites
evaluation
reconstruct
differences
leaving
permi
perm
1234
plant
i1th
linear
chunk
shorter
media
104
frequencies
gain
puzzle
splitting
buildings
wrapping
container
calculates
sent
send
indirectly
consecutively
unknown
neighboring
walls
unless
limited
neither
interpreted
school
shares
forever
bags
opening
stand
mountain
cant
computer
likely
solutionint
merged
triplet
connects
chose
appended
r1
meeting
keyboard
c2
printed
numi
yj
milliseconds
05
00
coin
inclusively
pairsi
successful
cause
proven
wi
phone
toward
shapes
nice
green
converting
nested
matching
him
expected
custom
ended
positioni
deletions
employeeid
immediate
works
describe
alphabetically
endpoint
automatically
threshold
objects
outgoing
anagrams
temperature
distances
knows
bc
domino
shifting
produce
collected
nesting
palindromes
increments
indexing
frog
removals
applies
symbols
simply
40
bar
overall
mapped
section
internal
serialized
window
heighti
partitioning
indicesi
--
nums1length
walking
component
quality
unfortunately
api
causes
gives
integral
seq
root-to-leaf
diagram
diagonals
outer
attack
entries
restaurant
alphabetical
balloon
keeping
happen
direct
passengers
lost
aforementioned
yields
y-axis
counter-clockwise
bobs
question
unlock
slots
unable
numsleft
numsright
xth
activity
minus
whenever
compared
themself
status
error
regular
partial
neighbor
languages
deletes
beyond
representations
disturbing
composition
includes
kinds
011
reduce
hello
route
magic
token
trips
planted
criteria
month
coming
dates
pathsi
numsn
starttime
specified
chunks
endtime
periods
capital
19
14
arrows
components
sale
optimal
simplified
shifts
processed
messages
idle
passing
infected
blocked
environment
-231
look
games
instructions
calculation
disconnected
supply
alphanumeric
banned
parenthesis
connection
connections
begins
apple
conversion
sj
journey
finding
infinitely
arrange
decrement
security
attend
preceding
numsnumslength
alength
standard
010
0100
candidates
pi
2359
24-hour
robots
face
euclidean
usual
yellow
mod
rowi
daily
complement
allocated
email
dot
valuei
planning
matter
turned
paint
phrase
logsi
aj
further
x-coordinate
ignoring
train
office
n-ary
nary-tree
emails
colorsi
fnarri
degree
delivery
try
rearrangement
hidden
travels
intermediate
orderdate
determined
provide
xn
lodashs
2s
account
considering
splits
grow
islands
f1
remember
roadsi
balance
itemsi
generator
dropped
view
rangesi
i-th
rotations
ranks
skip
undefined
ranging
accept
traverse
folder
respective
simplicity
built
parameter
named
0-based
causing
parenti
seven
500
27
nine
strange
costsi
desired
instantaneously
encode
attributes
two-dimensional
signifies
refer
photo
besides
17
initialized
records
choices
nums2length
bad
discount
selling
lies
spell
online
continuously
happened
float
display
traveled
track
stations
rate
picks
passenger
nobody
receives
repetition
finds
ki
occurring
cross
crosses
river
buses
basket
baskets
clear
questions
constructs
b2
distribution
amounts
quantities
roll
rolls
market
machine
activities
spiral
boundaries
recursively
shuffled
a0
an-1
anything
appends
actually
acyclic
resultant
reaching
topmost
135
ties
close
110
-2
separating
triple
though
scheduled
routes
via
0-9
kilometers
flowers
pyramid
sk
belonging
trivially
ten
meetings
engage
ugly
labelled
enhances
known
net
pressed
endtimei
starttimei
actions
recover
night
regions
shared
star
login
eight
knight
files
terms
arr2j
arr1i
recent
2-dimensional
reduces
unlimited
numerical
--------------------------
treated
rectanglesi
ratio
legal
jumping
arguments
hasnext
critical
diff
nums3
deepest
summation
wordslength
xy-plane
keeps
stick
s3
queens
ever
r2
getint
candiesi
non-space
yyyy-mm-dd
dots
postorder
abcc
xj
dashes
resolve
acb
title
heightsi
vali
bitwise-xor
234
collide
unrooted
die
n2
command
origin
decreases
appending
a3
blank
aaa
restrictions
strength
constraint
equation
successfully
bookint
booking
ranking
better
resulti
coli
wordsj
session
distancei
acceptable
execute
listed
local
domain
tower
preferred
rob
xs
buffer
searchword
axes
cuts
counter
behind
eats
eating
details
tells
iterator
y-coordinate
furthermore
dist
appeared
leetcodecom
valsi
vals
unoccupied
startpos
wide
seatsi
interface
pointers
possibilities
script
statement
variables
compressed
arrangement
lying
configuration
tournament
participating
picking
gridm
grid00
1n
double-ended
deque
mathematical
key-value
recursive
hamming
main
erasing
fibonacci
insertint
interested
productname
temperatures
optionally
colori
throws
180
few
positionsi
finishing
k-1
arrivali
dominoes
startvalue
imagine
i1
i0
sometimes
videos
adjacency
graphij
spread
comprise
manhattan
prerequisitesi
numcourses
vpss
deptha
depths
maxdeptha
vps
depthb
fx
list1
list2
contest
obtaining
xy
held
visiting
signal
callback
folders
whitespace
floors
sub-arrays
compare
001
gridrc
lands
reformat
filling
inorder
zigzag
fraction
therefore
paired
paper
finishes
speedi
root2
root1
project
numsl
working
denominations
numerals
principle
six
correspond
context
teacher
06
buying
1-9
dont
solving
stacked
dimensions
assumed
1-based
cellsi
gridrowcol
matij
bought
designed
covers
involving
backwards
powers
targetsum
aligned
requires
ring
press
effect
24
conflict
contents
--------------------
bounds
balloons
t1
checked
t2
income
bound
bracket
mini
distributed
dollar
everyone
iterates
iteration
partially
2k
keysi
warehouse
crossing
old
catch
managerid
managers
dead
lock
stacks
312
structurally
fair
6-sided
valued
dice
vice-versa
factory
eventually
comprises
averages
loss
uncolored
giving
numarray
sumrangeint
numarrayint
testing
implemented
len
guarantee
tell
retrieves
34
aec
matrixs
big
objective
1101
foo
upcoming
wish
preparing
ancestors
subgrid
drive
drives
plots
violating
plot
wordlist
prerequisite
relations
relationship
non-leaf
evaluating
commas
serialize
successive
contrast
wonderful
monotone
28
flower
unchanged
pref
tweet
59
tweets
listinteger
10000
lucky
findint
occupies
solved
traversing
entirely
offers
reminder
2-d
unsorted
sends
arriving
elapsed
reply
sub
region
reversing
64-bit
unsigned
calculations
divisibility
amounti
logged
someday
device
chess
directory
info
reading
levels
feed
subjected
fuel
destroyed
distributions
closing
movies
movie
referred
5th
determines
connectionsi
nums1j
absnumsi
gcdx
avoid
whereas
existed
plants
shot
sticks
visible
chain
swapped
libraries
s0
locked
pairings
submatrix
mouse
singly-linked
half-open
meetingsi
corners
spanning
max
staircase
unused
255
addresses
ip
seqi
seqlength
sheet
col2
row1
row2
col1
excel
numsk-1
afterward
cab
--------------------------------------
asyncronous
merging
parentsi
subgraph
expansion
mm
val1
val2
sliding
climb
restriction
service
x0
booleans
ladder
boardrc
obstaclesi
unary
attain
weightsi
peoplei
bbb
volume
75
getting
cpu
success
coefficient
implementing
depending
pointing
bsts
worst
erase
bricks
pushed
shuffling
tuples
buckets
magical
quadruplets
execution
reject
executing
experience
105
member
members
carpetlen
password
eventsi
live
poor
cubes
guards
captured
normal
rear
isempty
isfull
arr1length
parser
deserialize
deserialized
action
p2
p1
angles
-9
frequently
putint
updated
cj
precedence
run-length
preserving
cousins
ride
disti
in-order
graphs
truncate
expectednumslength
assertions
assert
expectednumsi
expectednums
evaluated
fruits
bef
lexicographic
marks
edgesj
judged
requirement
asks
filetxt
liters
bac
paid
hire
even-indexed
odd-indexed
years
departmentid
departments
stashed
robber
1100
individual
case-sensitive
converts
inputoutput
viewed
worked
queen
placement
non-intersecting
connect
ability
startrow
instruction
height-balanced
widths
xi1
submatrices
drawing
simulate
deeply
jsonparse
json
dies
timesi
factorial
selecting
targets
occupy
stays
cd
extended
res
delay
forgot
link
formats
elevation
flatten
102
sales
aba
force
sn
getrandom
12345
arrleftright
2h
rides
transferred
typei
gridi
eee
rightward
relation
wooden
ant
energy
load
expressed
angle
tag
browser
floating
words1
words2
lower-case
labelsi
halves
ages
agesi
targetx
targety
university
abcdefghijklmnopqrstuvwxyz
guessed
guesses
equationsi
equations
relationships
hands
ranksi
yourself
copies
reordered
ik
nums2i1
gcd
typing
examine
malware
minitial
cherries
blength
answersi
deck
decki
patterns
triangular
a4
obeys
wasted
init
ccc
f2
f3
specify
242
4237214
274
powx
replaces
viewing
half-closed
delayed
sij
layer
layers
cyclic
signs
preserved
communicate
sure
sections
opponents
biginteger
namesi
reuse
left-to-right
forest
tallest
sub-array
salaries
jobs
parameters
police
alerting
contact
typically
clock
maximizes
respect
restricted
flipped
entering
unlocks
graphi
enters
movements
fifth
flattened
painting
2020
matrices
slices
touches
ingredients
owner
uncommon
apples
numsr
assignment
show
pos
touching
customersi
uniquely
well-formed
---------------------------
chars
indexi
driving
str1
str2
cutting
denominator
falling
aab
32
upper-case
eaten
notation
identify
2th
mixed
frogs
successor
concept
parent0
iv
iiii
xx
ix
xii
ii
roman
xxvii
400
usually
numeral
900
s1i
printer
cream
bars
ice
boy
summer
downwards
a-z
grouping
kjf
11106
aajf
bijection
ticket
tickets
songs
timej
song
recurse
sub-grids
sub-grid
quad-tree
bottomright
bottomleft
wiki
topleft
proper
terminator
topright
isleaf
widthi
mutate
roomsi
personid
classes
page
puts
3x
rootval
rings
button
dial
align
metal
spelling
keyi
durationi
enemy
attacking
maintain
pid
attribute
numerically
restaurants
burst
bursting
consistent
ratingi
soldiers
subordinates
indirect
importance
maxi
growing
trimmed
trim
sleftirighti
ij
peak
213
differing
lca
decrypt
permitted
decrypted
efficiency
waits
efficient
meters
housesi
fs
percent
displays
slot
wheel
turning
b1
ascii
gap
updateint
incorrect
recorded
activitytype
machines
processes
matrixrowcol
originally
duplicated
got
node2
node1
transformed
cipher
an-2
numsindex
uniform
shouldnt
backspace
non-digit
numsnumslength-1
345
outcome
lot
invert
modifies
separation
triples
situated
dag
tripsi
farmland
inverse
week
sunday
tuesday
monday
endword
beginword
strategy
skipped
smart
party
vote
-k
comma-separated
non-null
circumference
ycenter
xcenter
-7
non-equal
separately
pairwise
gardens
120
210
freq
monitor
exchange
contaminated
stocks
cinema
33
reserved
18
1d
speciali
transfer
requestsi
transfers
reside
piecesi
presses
newly
tested
independently
buttons
shiftsi
shifta
images
-10
addnumint
instantly
processing
master
arrived
gone
drawn
spreading
install
spreads
installed
resources
installing
uninfected
batch
eventdate
playerid
deviceid
gamesplayed
logging
sequential
attempts
stopped
uniformly
inner
instructed
stands
performs
anti-clockwise
extending
news
followerid
tweetid
post
creating
smash
fi
case-insensitive
cookies
abcba
odd-numbered
describing
extract
prefers
preference
queues
studentsj
everybody
identified
orange
mine
collecting
gold
6th
minimizes
optimize
exceeding
pig
nums2i2
fulfilled
late
attendance
absent
award
eligible
maxtime
fee
108
flood
lakes
penalty
plantsi
refill
watering
super
primes
diameter
arrow
flat
awesome
arrangements
x3
n-queens
hash
removekey
0110
foods
yes
cat
tracks
join
laser
interfere
plan
firsti
frame
spans
dropping
shaped
hits
incomplete
doubly
layout
targeti
02
19216811
worth
pointslength
convenience
defines
natural
1010
genetic
space-separated
convex
polygon
triangles
rational
hh
coprime
repair
repaired
limitj
limits
rollsi
coinsi
short
url
nums0i
i-1th
curr
simulates
snake
squared
commands
distributing
carry
carries
skill
skills
serve
025
someone
stamps
stopping
single-threaded
ratings
strengths
difficulty
excluded
cups
quarter
liquid
cup
glass
1001
fizzbuzz
buzz
fizz
category
mass
selection
73
ranked
tank
gas
disappear
erased
brick
popped
asteroids
asteroid
collisions
active
bucket
fed
numsd
numsc
numsb
numsa
entrance
exit
pool
promises
executes
promise
pending
matrixij
studentid
subject
subjects
pascals
alphabetic
family
parents0
mid
capitalization
picky
book
favorite
tilesi
computing
xxxx
weak
strong
transactionsi
allotted
surface
startj
flights
flight
cheapest
numsn-1
numsk1
robbing
capture
os
bulbs
pushing
fifo
programming
rotten
fresh
boomerang
arr2length
bill
90-degree
si1
-5
maintained
incremented
invalidate
recently
cache
innermost
holding
bj
likes
quote
yet
sourcei
effective
nextint
3n
bomb
completing
ignore
floating-point
treesi
farthest
mail
landing
majority
punctuation
removeduplicatesnums
kept
lined
filtering
exclusive
rowj
colj
guarded
quotation
slash
bacd
cloned
fruitsi
vyz
abcdefuvwxyz
bonus
solvable
struct
populate
0124567
4567012
stationsi
liter
miles
multiplicity
term
2x
related
orderid
45
provides
pixels
weakest
army
kingdom
categories
operates
spellchecker
copied
deep
pays
57
citys
contour
skyline
ground
capacities
rope
proved
costij
training
matched
index1
index2
startcol
advances
permute
fibonacci-like
xi2
ansj
partner
took
tries
e1
union
e2
rx
cartesian
resets
peekpop
natively
supported
movecost
calculator
eval
retrieve
numrows
king
marking
birth
death
older
tied
votes
cached
memoized
stonevalue
012
seed
definitely
systems
resolved
expiration
unrevealed
mines
revealed
a-b
afterwards
bloom
planting
potentially
totally
non
countint
f0
app
treenode
transmitted
serializationdeserialization
reconstructed
optional
raining
trap
pre-order
223
80
prepending
cook
collects
buyerid
2019
sellerid
bishops
bishop
rook
rooks
idx
driver
taxi
dividing
peek
doctors
profiti
groupi
save
parsed
warmer
selldate
lcpij
lcp
wordjn-1
wordin-1
aaca
aabd
travelleddistance
enjoy
enjoyyourcoffee
coffee
ideab
naming
ideaa
ideas
transactedon
transid
mst
msts
pseudo-critical
rulekey
namei
rulevalue
flying
acosti
bcosti
interview
fly
gridin
1e-5
succprobi
dartboard
dartsi
throwing
threw
dart
darts
targetsi
eeecd
sources
replacements
abbc
sourcesi
testcase
streak
alone
mirrored
watch
0-59
turnedon
leds
1002
led
0-11
451
pm
abaacc
xn-2
xn-1
turbulent
comparison
ants
plank
searchcost
gifts
bcdea
-numsi
2d-map
ycentre
xcentre
require
actuali
minimumi
i2th
loadi
computational
busiest
busy
handled
escaped
backslash
cardpoints
tromino
tilings
tiling
summing
finalsum
vision
posx
angle2
posy
obstruct
determining
foobar
printfoo
printbar
containedboxes
initialboxes
statusi
containedboxesi
3200
celsius
fahrenheit
27315
kelvin
watered
taps
tap
one-dimensional
k-repeating
243803
801
243801
803
243
bottoms
bottomsi
tops
topsi
aval
bval
ac
ababbc
baa
abcbabcbcb
agex
agey
expectedi
annual
specialroadsi
startx
y1i
y2i
x2i
starty
specialroads
x1i
52372
numsliri
arr3
arri-k
arr4
k-increasing
arr5
grades
reverses
wraparound
zabcdefghijklmnopqrstuvwxyzabcdefghijklmnopqrstuvwxyzabcd
insertlast
mycirculardequeint
mycirculardeque
deletelast
insertfront
getrear
deletefront
getfront
guessesj
lazy
says
walks
4-directional
non-obstacle
smallest-valued
5489355214
5489355412
care
5489355421
5489355142
5489355241
alex
xiyi
xiyihere
one-letter
ret
reti
items1
items2
suitsi
flush
suits
suit
poker
tape
asdfghjkl
zxcvbnm
american
qwertyuiop
patterni
dv
options
dva
minnums2i0
nums1ik
nums1i0
nums1i1
nums2ik
numcarpets
floori
carpets
solitaire
consisiting
recorddate
weather
yesterday
returnedarrayi
arraymap
h2o
h2o2
h2o2he3mg4
atom
formulas
chemical
atomic
h1o2
h2o23
belowi
abovei
rowconditionsi
rowconditions
colconditionsi
colconditions
k-diff
102001
121000
cae
bce
completion
uploaded
luprefix
uploads
luprefixint
upload
uploadint
subpath
arrlen
clip
lasted
clips
clipsi
sporting
refereeid
accountsij
richest
wealth
edit
edits
powerful
cherry
thorn
y0
trios
trio
encodes
powersj
classs
superclass
clumsy10
factorial10
clumsy
rectsi
rects
pleasing
aesthetically
stacking
three-letter
beneath
respecting
resizing
dynamic
sizet
designing
resize
numst
vacant
prison
beans
bean
indexs
unmarked
createcounter
non-repeating
fnx
hx
gx
fghx
identity
querycharacters
queryindices
lengthsi
queryindicesi
querycharactersi
precisely
deliveryid
customerprefdeliverydate
depthc
numbercontainers
changeint
fills
infrastructure
ath
list1s
bth
reindexing
4253
raised
remap
congratulate
d2
326
d1
remaps
remapping
sneakily
mittal
danny
weekly
looking
projections
projection
planes
3-dimensional
shadow
zx
yz
gregorian
sxy
requestaccepted
requesterid
accepterid
acceptdate
rightsumi
leftsumi
cyclically
deci-binary
112
3001
divisorsi
incurred
traffic
signals
arraygroupbyfn
groupby
routesi
routes0
even-valued
grandparent
s1s
alicearrows
archery
bk
ak
numarrows
scoring
bobarrows
shoots
floornumsi
mycalendarthree
k-booking
bring
bannedi
arrbannedi
ologarrlength
port
package
ship
packages
ideal
digitsi
upon
restrictionsi
breaks
eggs
unbroken
egg
certainty
worddict
reused
segmentation
empid
joined
1337
row-wise
walked
heads
linked-lists
correctly
ahead
realized
stationary
rests
datetime
refers
filedirectory
directories
tonight
professional
history
enddayi
startdayi
boxesi
100ms
400ms
50ms
30ms
cancelled
60ms
ty
sx
sy
tx
routine
aalength
235
indexes
till
million
population
fn-1
forth
brings
sessions
tic-tac-toe
maxdistance
filter
leftright
disconnect
past
safe
protected
entered
designated
tab
fruit
v1
v2
mode
movesi
gridrowicoli
initialize
exceeds
increased
listnode
saleid
companys
maxsum
researcher
researchers
h-index
citationsi
papers
citations
published
cited
removeint
extension
colsum
encodedi
fancy
completes
reduced
one-lane
speeds
collides
fleet
attending
infinity
dash
slice
cheese
decrements
comparing
faster
performance
searchint
situation
produces
cooldown
home
overlapped
single-space
traversed
wordlength
cba
newnums
newnumsi
k2
k1
yield
chalkboard
finite
const
supposed
groupsi
bash
456
fractional
losing
2510
121241510
gains
incoming
projects
serving
latter
former
js
chef
rented
manages
insertstring
thrown
february
0190
maxsize
worry
sake
handling
drops
knights
applications
pairing
scoresi
rain
efficiently
queryint
pad
strongest
rods
collision
truck
important
things
eliminate
views
popular
transpose
aeb
aebdc
pj
linked-list
dominoesi
engineer
advance
internally
tails
abbreviated
reporting
computers
throughout
sea
compress
sudoku
sub-boxes
staying
searches
multi-dimensional
reformatted
searchstring
article
warm
0001
comma
molecule
borders
intersecting
forwards
modifications
deposit
withdraw
depositint
withdrawint
pizza
console
printnumber
prints
entry
logical
bug
ch
fashion
youre
sensitive
ipv4
java
compiler
numsr-1
numsl1
safely
self-edges
answerx
hexadecimal
assigning
locks
croak
croakoffrogs
printing
croaks
successors
s2j
text2
text1
targetgridrowcol
solid
targetgrid
sweltering
chalk
chalki
restart
mn
px
ticketsi
queuing
abcdefghijklmnop
cdefghijklmn
ab121p
arbitrarily
understand
cuboid
lengthi
cuboidsi
widthj
lengthj
cuboids
heightj
262124
zbax
odd-valued
aaccggta
8-character
aaccggtt
endgene
startgene
investigate
mutation
gene
mutations
hotel
roomidi
sizei
preferredj
absid
minsizej
lastname
addressid
firstname
orderings
top-to-bottom
rith
flooded
cith
enrolled
homogenous
isbadversionversion
developed
versions
develop
fails
sqrt
numzeros
-1s
numnegones
numzeroes
numones
buys
developer
web
pages
1-d
seqk
seq1
seq0
numsseqj
forwardbackward
blocksi
recolor
non-horizontal
references
ologm
numsinumslength
357
numsii
159
minrootleftval
sub-node
rootrightval
sub-nodes
keyword
1200
engraved
fallout
spelled
anticlockwise
quest
trail
purpose
pressing
freedom
stage
door
super-palindromes
super-palindrome
lastdayi
coursesi
poison
timeseriesi
attacks
teemo
poisoned
hero
timeseries
timer
ashe
starttime1
endtime2
starttime2
event1
event2
endtime1
346
identifiers
digit-logs
letter-logs
space-delimited
identifier
tiv2016
insurance
policyholders
2015
policyholder
2016
tiv2015
lat
lon
investment
latitude
longitude
policy
holders
tablenumberi
ordersicustomernameitablenumberifooditemi
fooditemi
header
customernamei
wisely
chronological
stationname
railway
underground
startstation
checkout
checkoutint
undergroundsystem
checkin
getaveragetimestring
getaveragetime
endstation
checkinint
ratingk
ratingj
soldier
employeesisubordinates
employeesiimportance
employeesiid
taxes
upper0
percent1
upperi-1
tax
bracketsi
percent0
earned
upperi
bracketslength
percent2
taxed
percenti
upper1
upper2
airplane
consuming
graphical
trimi
kith
candle
candles
plate
plates
logn
om
logm
lenarr
decryptstring
encryptstring
encryption
encrypts
encrypterchar
carried
decryption
encrypt
encrypted
encrypter
righttoleftj
regulate
righttolefti
warehouses
lefttorighti
lefttorightj
pickoldi
bridge
putnewi
nummoves
departure
busesi
passengersj
departs
lo
tastiness
sells
rec2
rec1
touch
distance0
distance2
distance1
distance3
mailboxes
mailbox
truefalse
answerkeyi
answerkey
confuse
maximizing
ts
trues
falses
wrap
wheels
codes
deadends
floorx
floorpilesi
stack-like
freqstack
preserve
minai
bn
ti
maxcost
retail
quantitiesi
specialty
stockprice
correcting
volatile
worse
nature
processingtime
machineid
processid
lonely
northwest
rstart
cstart
grids
southeast
minn
rankp
rankq
answerrowcol
hospital
patientname
patientid
patients
diabetes
diab1
sqrt2
graphint
edgecost
shortestpathint
addedgeint
edgecosti
appearance
substituted
substitution
gift
numpeople
scrambled
scramble
mappingi
0144567
4567014
recyclable
fat
lowfats
sumnums0numsi
runningsumi
addpatch
patches
rand7
rand10
argument
addtextstring
min10
editor
cursorleftint
cursor
texteditor
cursorrightint
currenttextlength
deletetextint
cursorposition
simulating
guessing
getmin
minstack
retrieving
a123bc34d8ef34
2maximumbit
maximumbit
mat20
mat42
mat31
444
loseri
defeated
matchesi
winneri
addcarint
park
medium
parking
parkingsystemint
cartype
parkingsystem
inverting
-20
-23
-22
sentence1
my
sentence2
jane
10921
bitwise-and
imply
mechanism
mainly
seem
operating
printfirst
comprehensiveness
printthird
printsecond
maxlocal
maxlocalij
storekeeper
bbabba
bababcba
bba
heightsrowcol
hiker
hike
columns-1
rows-1
hope
effort
unidirectional
subgrids
puppy
eyes
legs
vehicle
numpassengersi
no-adjacent-flowers
flowerbed
fertile
farmer
bottommost
barren
apex
pyramidal
friday
wednesday
thursday
saturday
senators
parties
victory
rights
announce
exercise
radiant
predict
senator
voting
senate
dota2
round-based
dire
ban
semester
semesters
nextcoursei
prevcoursei
relationsi
childrens
evaluations
bottom-up
934126
sentinel
encounter
solutiondouble
randpoint
wiggle
abab
ccjjc
leap
business
leavebob
rome
mm-dd
5-character
leavealice
31
arrivealice
arrivebob
5678
1238
5674
permn
numspivot
minnumsi
12312
site
recordtweetstring
70129
frequencys
tweet3
tweetcountsgettweetcountsperfrequencyminute
analysis
86400-second
3600-second
1010000
059
60-second
997010000
6060
1069
tweet30tweet360tweet310minutetweet3059minutetweet3060tweet3120hourtweet30210
tweetcountsrecordtweetrecordtweetrecordtweetgettweetcountsperfrequencygettweetcountsperfrequencyrecordtweetgettweetcountsperfrequency
nullnullnullnull221null4
130189
analyzing
tweetcounts
gettweetcountsperfrequency
103609
0210
tweetcountsgettweetcountsperfrequencyhour
gettweetcountsperfrequencystring
721010000
tweetname
36107209
recordtweet
tweetcountsrecordtweettweet3
numexchange
bottle
bottles
drinking
numbottles
drink
xyz
querychar
axyz
streamcheckerstring
streamchecker
detect
abcabc
treenodeleftval
findelements
recovered
treenodeleft
recovers
treenoderightval
findelementstreenode
treenodeval
treenoderight
gainloss
stockname
operationday
reservedseatsi
38
reservedseats
exceptional
aisle
four-person
123450
organised
colscount
transforms
rowscount
snailrowscount
iterating
snail
uni-valued
necesssarily
comprised
specialin
needsi
specialij
offer
achievable
season
128
self-dividing
releasetimes
released
keyspressedi
releasetimesi
keypress
keyspressed
releasetimes0
keypad
tester
keypresses
lays
querytime
homework
ghostsi
xtarget
ghosts
pac-man
ghost
escape
ytarget
2-9
telephone
shiftt
shiftz
addelementint
calculatemkaverage
mkaverage
mkaverageint
getintervals
summarize
summaryranges
seen
summary
periodically
resend
channels
replies
patiencei
patience
originating
resending
channel
slant
isinfectedij
isinfected
modeled
affected
threatens
quarantine
rapidly
virus
careful
divi
div
word0i
similarity
arts
tars
rats
ordersi1
ordertypei
ordersi
backlog
illustrated
orthogonal
fntxtfncontent
f2content
f1txt
fncontent
f1content
fntxt
rootd1d2dm
f2txt
f1txtf1content
f2txtf2content
directorypathfilenametxt
math
elementary
rewarded
352
submitted
grade
eg
transactionid
mall
visitid
faces
arr1i-arr2j
end-nodes
followint
composes
twitter
followunfollow
getnewsfeedint
unfollowint
unfollowing
posttweetint
followeeid
posted
1-dimensional
10xxxxxx
unicode
11110xxx
translates
utf8
1110xxxx
bytes
byte
110xxxxx
octet
-------------------------------------------------------------
0xxxxxxx
utf-8
n-bytes
1-byte
ni
backspacing
editors
14234
12344
locationsj
locationslength
locationsi
repetitions
sub-sequence
race
tire
laps
tiresi
lap
numlaps
changetime
tires
rix-1
paragraph
i2
multiplications
-100
imaginary
realimaginaryi
complex
cookiesi
unfairness
stamp
left-most
stamped
targetlength
genre
boring
description
tilt
mud
excavate
digi
underneath
artifact
c1i
dig
uncovered
r2i
artifacts
c2i
artifactsi
r1i
buried
width-to-height
interchangeable
widthjheightj
widthiheighti
sandwich
sandwichesi
lunch
sandwiches
cafeteria
ramp
removable
removablelength
sremovablei
trusts
secretly
town
trusti
trust
rumor
oranges
kitchen
computation
ea
even-numbered
blacklisted
blacklist
turnn
turn1
personname
kilograms
combinationiteratorstring
combinationlength
combinationiterator
server-to-server
made-up
ma
oatgma
goat
consonant
latin
applema
nums2k
nums1i2
nums1k
maxjump
minjump
needle
haystack
valuediff
indexdiff
orient
transport
narrow
reorienting
ministry
passingfees
fees
passingfeesj
lcm
non-coprime
harmonious
floods
lake
rainslength
rains
anslength
rainsi
dry
closes
incur
2d-array
early
indiceslength
y-direction
spherical
taped
stretches
y-coordinates
xstart
xend
13254
uniquely-sized
maxmoves
xcnti-1
subdivide
xcnti
cnti
mistake
myhashset
addkey
hashset
containskey
1110
lockedi
meal
meals
deliciousness
deliciousnessi
studentsi
mentorsj
mentors
compatibility
student-mentor
survey
achieved
mentor
col2i
row1i
queryi
col1i
row2i
matxy
graph1
grapha
hole
12335
instructionsi
1235
min2
stonesj
third-largest
122
distinctly
second-largest
18291174312
21347112918
removerangeint
rangemodule
tracking
addrangeint
tracked
overlaps
queryrangeint
module
anti-theft
devices
activated
beam
while1
beams
banki
xored
secondi
secrets
firstperson
stuck
redirects
redirect
boards
productkey
deleteatindexint
prev
addatindexint
pointerreference
addattailint
indexth
addatheadint
mylinkedlist
fingers
unusuable
wordsjk
03
additive
numselect
cnumselect
0011255245
1921681312
012201
3245
2582
fronts
backs
backsi
frontsi
rth
col1row1col2row2
colrow
changenumi
mutating
13024
24130
bix
countj
pointsj
heshe
10101
morse
international
----
transformations
millis
sleeps
firstlen
secondlen
differencei
equal-length
differenceij
wordsij1
wordsij
type-2
type-1
columntitle
redistribute
maxheightsi1
heightsj
heightsi2
minheightsi
heightsj-1
parentsx
nodei
triangulate
triangulation
n-sided
portion
1230001
123001212
nonrepeatingpart
016
integerpart
016666666
repeatingpart
212
016666
conventionally
integerpartnonrepeatingpart
integerpartnonrepeatingpartrepeatingpart
validly
gcdval1
climbing
repairs
factories
positionj
roboti
factoryj
observations
went
observation
fortunately
presence
shorturl
httpsleetcodecomproblemsdesign-tinyurl
companion
encodedecode
httptinyurlcom4e9iak
tinyurl
tiny
encodestring
shortening
decodestring
longurl
most-significant-bit
least-significant-bit
i-2th
-14-13
destinations
boustrophedon
style
mincurr
boardn
-y
middleindex
numsmiddleindex1
numsmiddleindex2
numsmiddleindex-1
conventions
op3
adhere
negation
op2
op1
accommodate
unnecessary
weirdly
inventory
inventoryi
weightsj
marble
marbles
boats
boat
chemistry
skilli
sentence4
is2
this1
averagearr
averageb
averagea
soup
ml
mls
stampheight
stampwidth
enqueuetimei
act
processingtimei
spells
potionsj
potions
spellsi
potion
mex
-123
103
champagne
pouring
pictured
glasses
excess
100th
poured
prefixi
xvalue
mycalendartwo
base-10
contrary
k-mirror
2-mirror
base-k
base-2
trimming
typewriter
variance
searched
pangram
remainder
bulky
heavy
numsnumsk
numsnumsnumsk
763
-55
-255
ns
largest-valued
word2j
word1length
word2length
word1i
sortracker
tracker
invocation
queried
addstring
scenic
attractiveness
invoked
querying
gasi
circuit
erasures
stable
hitsi
erasure
explode
2i
listing
labeling
10-6
envelope
envelopes
doll
russian
envelopesi
repetitively
sentencesi
zzxy
xyzz
xzzy
special-equivalent
alicesizesi
bobsizesj
bobsizes
alicesizes
2019-07-27
sendmessage
opensession
sessionid
activitydate
scrolldown
endsession
hamsters
hamster
hamstersi
numsleft1
therere
entrancerow
maze
entrancecol
resolves
functionsi
promisepool
attended
examinations
subjectname
studentname
rowindex
rowindexth
foodratingsstring
newrating
highest-rated
changeratingstring
cuisinesi
ratingsi
cuisine
foodratings
foodsi
cuisines
highestratedstring
freed
freeint
allocator
functionalities
allocatorint
allocateint
capitalized
capitalize
spectators
allocates
maxrow
bookmyshow
gatherint
ticketing
vary
hence
hall
concert
bookmyshowint
scatterint
companies
favoritecompanies
favorites
favoritecompaniesi
carpet
dress
washing
dresses
asterisks
10-13
0-3
somewhere
masked
---xxxx
--xxxx
personal
mask
baaba0
baaabb0
150
cashbacki
autoincrement
consume
poisonous
survive
pigs
minutestotest
minutestodie
irregular
3d
glue
hats
wear
hatsi
flightsi
src
dst
0124445667
4566701244
gang
duty
thieves
securityi
exclusively
cornered
functionality
statuses
3k
frontmost
popback
pushbackint
popping
popmiddle
popfront
pushmiddleint
pushfrontint
frontmiddleback
dequeue
mycircularqueuek
enqueueint
mycircularqueue
benefits
non-alphanumeric
n-bit
gray
133
elapse
boomerangs
tuple
matters
nestedinteger
on2
shifted
uam
purchased
cashier
productsi
amountj
getbillint
paying
supermarket
groceries
productj
cashierint
subtotal
frequented
p4
p3
numsli1
numsli
numsri
lfu
lfucache
lfucacheint
invalidated
square-free
startindex
pillow
cheating
classroom
taller
maxci
maxbi
tripletsj
max5
tripletsi
max3
max2
maxai
bananas
loves
slowly
bananas-per-hour
koko
numsnumsi
zero-based
macros
comments
implicit
control
comment
newline
exhaust
exhausted
rleiteratorint
281825
exhausts
88855
rleiterator
encodingi
3825
380925
rle
detonated
bombsi
felt
bombs
detonate
licenseplate
12c
insensitive
abccdef
caaacab
cbca
isomorphic
months
relationsj
prevcoursej
nextcoursej
trains
commute
depart
107
up-left
mynumbers
subroot
treesj
columnnumber
interesting
aliceleetcodecom
mynameemailcom
mails
everything
myemailcom
filtered
alicezleetcodecom
emailsi
forwarded
assumes
truncating
beautifully
truthy
arrayfilter
1end2
0start3
functionidstart
endtimestamp
guard
wallsj
guardsi
obstructed
ampersand
entity
lt
apos
frasl
entities
amp
html
gt
quot
targetwords
verifying
cbda
startwords
acbd
arr1j
arr2i
harvest
depicts
strs1
strsn
strs0
strs2
closer
nameisageyearsold
knowledgei
knowledge
bookings
bookingsi
lasti
numsansi
interactive
mountainarraygetk
mountainarray
circumvent
attempt
disqualification
mountainarrgetindex
mountainarrayget
mountainarr
submissions
mountainarraylength
changedate
2019-08-16
newprice
fix
arri-1
countsi
pills
pill
workersj
requiring
pickupdelivery
pickupi
pickup
services
deliveryi
originali
original0
derivedi
cbad
numsstarti
numsendi
depth-first
dfs
prior
self-loops
nummatrix
sumregion
nummatrixint
sumregionint
altitude
altitudes
gaini
biker
explore
tenth
10th
theres
nums2n
nums10
nums1n
nums21
nums20
nums11
differencesi
hiddeni
fueli
mile
startfuel
transferring
refuel
refueling
countintervals
tables
sex
temporary
ocurrences
symmetric
mirror
5c
-2aaa
well-formatted
breaking
evalvars
3bb
4a
asterisk
evalints
3aab
-1a14
aabc
-6
alternates
comid
commission
salesperson
salesid
salespersons
alongside
hiredate
commissionrate
6141
6741
6174
61741
nextvisiti
nextvisit
rhombus
purple
depicted
biggest
gender
parsers
al
interpretation
interpret
flag
joins
primaryflag
robbed
refuses
steal
homes
steals
capability
dislike
dislikes
dislikesi
imagesrsc
imageij
sc
pixel
sr
doubled
saves
key-card
2251
one-hour
keytimei
key-cards
keynamei
keytime
doors
keycard
alert
2352
keyname
emits
0949
2351
wizard
ruler
wizards
strengthi
halve
non-adjacent
capitlization
errors
yeellow
yollow
checker
handles
mistakes
yllw
xrandom
randomindex
brand
bills
lemonade
billsi
geometric
termination
absolutely
buildingsi
grounded
silhouette
512
511
skylines
collectively
x1y1x2y2
leavetimei
capacitya
cans
waters
capacityb
alicebob
hisher
expensive
fence
enclosed
well-fenced
ans0
ans1
variety
official
inspection
001101
size2
size1
matchings
trainer
playersi
trainers
trainersj
left-out
alter
numsindexk
numsindex1
numsindex2
indexk
expressible
competes
compete
secondplayer
against
winners
firstplayer
exceeded
fullfill
widths0
result1
result0
widths1
greatness
permuting
nextlargest
serversi
priorities
tasksj
partnerids
leadids
makename
dateid
dailysales
leadid
partnerid
suggests
suggested
minimums
pickindex
075
sumw
wlength
snapshotarray
snapshotarrayint
setindex
snapid
array-like
snapshot
snap
getindex
minh
mhts
46
maxlen
abefg
abefh
abdfh
acadbcbd
acefg
re2
abdfg
rabc
singleton
rabcdefgh
understood
ek
acdfg
ra
rabcd
rabbc
acefh
concatenations
comma-delimited
rexpr
re1
rw
grammar
acdfh
matrixxy
crossed
obviously
additionalrocks
rocksi
capacityi
rocks
last-in-first-out
lifo
mystack
islefti
descriptions
descriptionsi
childi
movecostij
basic
equality
isequal
o2
tright
tleft
baseball
operationsi
hj
queue0
queuej
kj
answerij
matrc
numsdivide
timestampprev
getstring
time-based
setstring
timemap
k-sum
gave
successorxs
childname
son
kingname
curorder
jack
inheritance
deathstring
grandchildren
successorking
getinheritanceorder
oldest
throneinheritance
parentname
whos
successoralice
successorjack
successorbob
born
throneinheritancestring
well-defined
birthstring
successorx
topvotedcandidate
cast
topvotedcandidateint
election
qint
personsi
factorialn
fib
fibn
dacb
abdc
001112
0120
destroy
seeding
043
accountsi
accountsi0
voter
position-one
voters
statements
statementsij
truth
statementsii
crossword
src2
src1
lastly
dest
constituent
setting
un-expired
inaccessible
setkey
getkey
overwritten
2314
84351
click
char
revealing
clickr
minesweeper
clickc
abe
ors
aar
accelerate
ba-c
hyphens
ab-
afad
hyphen
-ab
chunked
shuffle
planttime
blooms
planttimei
bloomed
growtime
blooming
growtimei
growth
seeds
def
dfe
adc
expire
renewed
authenticationmanagerint
tokenid
timetolive
renewstring
renews
renew
generatestring
authentication
authenticationmanager
currenttime
countunexpiredtokens
expiry
countunexpiredtokensint
unexpired
expires
heap
nim
gi
greed
cookie
tot
findsumpairs
findsumpairsint
nums2index
commonly
resrc
res0n-12
2height1
resr1c-2height-r-1
resr1c2height-r-1
follower
followers
discovers
forget
discovering
extracandies
kid
kids
cbtinsertertreenode
cbtinserter
getroot
compact
-123456e789
314
0089
--6
99e25
1e
2e10
e3
-90e3
95a54e53
6e-1
3e7
-01
535e93
1a
heightmap
indistinguishable
typesi
marksi
counti
cooperated
actorid
actor
directorid
actordirector
director
primefactors
microwave
interprets
finger
54
cooking
81
0954
startat
normalizes
fatigue
generic
99
pushcost
normalized
targetseconds
today
7212
stockspanner
73412
todays
quotes
span
qualityi
wagei
expectation
wage
athletes
medal
scorei
silver
bronze
athlete
pattern0
pattern1
divisions
appearing
unitprice
2019-01-01
2019-03-31
saledate
mycalendar
desiredtotal
re-use
maxchoosableinteger
traverses
noderight
nodeleft
subtracted
diffi
particularly
pawn
captures
pawns
groupsizes
groupsizesi
groupsizes1
signfuncproduct
signfuncx
fixint
coincide
bitsetint
compactly
unfixint
bitset
tostring
cancellation
clientid
client
role
unbanned
usersid
cancelledbyclient
driverid
2013-10-03
canceled
cancelledbydriver
requestat
cityid
2013-10-01
interleaving
t3
tm
peekingiterator
peekingiteratoriteratorint
prizes
prize
prizepositions
prizepositionsi
unvisited
doctor
advised
advice
noticed
candytypei
candytype
minprofit
crimes
participates
profitable
participate
crime
schemes
scheme
commit
solutionlistnode
absarri
putting
hercy
ababb
consecint
datastreamint
datastream
myhashmap
hashmap
alal1ar
lr
1112131415
1121345
nums2leftright
sumnums2
sumarr
nums1leftright
11231415
sumnums1
conveyor
shipped
belt
maxvalue
namely
1351315
551
resultj
requestsj
chips
chip
decoding
operands
rev123
revx
rev120
revnumsj
revnumsi
12321
non-star
stars
punishment
newflowers
caretaker
flowersi
ax2
ay1
by1
ay2
bx2
by2
rectilinear
ax1
bx1
supervisor
totals
256
version2
2533
revisions
revision
version1
toggle
bulb
targetword
021
firstword
secondword
n-digits
librarys
fish
fisher
jan
yyyy
oct
nov
apr
aug
2100
31st
1900
jun
sep
mar
dd
30th
jul
dec
feb
column-wise
evil
concatenates
golf
maxnumsj
mi
uniques
index-0
heada
skipa
lista
skipb
intersected
intersectval
listb
retain
headb
operationsi1
operationsi0
20000
50000
monthly
accountid
myqueue
jobdifficulty
dependent
schedule
difficulties
jobdifficultyi
wrote
seperate
1412
14312
suffixes
inertia
boxs
gravity
side-view
confirming
confirmation
confirmed
signup
signups
expired
timeout
confirmations
requested
arraylast
7777
3-1-5-9
13579
separator
thousands
reshaped
reshape
row-traversing
handy
matlab
wanted
cake
horizontalcutsi
verticalcuts
horizontalcuts
verticalcutsj
candidate
rungs
rung
canonical
unix-style
slashes
meanwhile
smooth
descent
exempted
progression
representatives
representative
delightful
soul
sound
exercises
eetcode
cool
universal
wrr
warrior
createhelloworld
reformatting
formatting
firstly
segmented
toggling
salaryi
delivered
storage
maxweight
maxboxes
delivering
portsi
portscount
ports
loaded
deliver
150ms
135ms
debounce
35ms
recieve
95ms
debounced
digital
rollmax
rollmaxi
introduced
simulator
constructb
constructai
constructa
constructa0
01101
32-bits
uni-value
153
havent
maxm
2m
pour
measurable
measure
jug
targetcapacity
jug2capacity
jugs
jug1capacity
arrrighti
arrlefti
advantage
pickint
gdp
countries
25000000
km2
twenty-five
continent
bigint
3000000
2d-plane
fk
arrk1
arrk0
clock-wise
arrkn
ps
losers
nums3k
nums4
nums4l
sessiontime
ops
opsi
mxy
skips
skipping
letting
hoursbefore
kmh
strs11
strs01
strs0strs0length
strs10
strs00
strs1strs1length
subtext2
subtexti
subtext1
subtextk
restaurantsi
veganfriendlyi
filters
maxprice
veganfriendly
freezes
sidelengthi
brushing
landed
queryname
database
poorquerypercentage
informtimei
headid
inform
manageri
urgent
managerheadid
subordination
k-similar
r-1
c-1
flipsi
prefix-aligned
secondlist
firstlist
firstlisti
endj
secondlistj
inversions
global
checking
peculiar
012345
permuted
4-length
hectares
four-directionally
forested
m-1
areas
organized
hectare
visitstring
leetcodecomgooglecomfacebookcomyoutubecom111linkedincom227
5000
facebookcom
browserhistoryforward1
browserhistoryleetcodecom
clears
nullnullnullnullfacebookcomgooglecomfacebookcomnulllinkedincomgooglecomleetcodecom
browserhistoryback2
browserhistoryvisityoutubecom
browserhistory
browserhistoryvisitfacebookcom
homepage
linkedincom
browserhistorystring
backint
youtubecom
browserhistoryback1
browserhistoryvisitvisitvisitbackbackforwardvisitforwardbackback
browserhistoryvisitgooglecom
forwarding
browserhistoryforward2
homepagelength
googlecom
browserhistoryvisitlinkedincom
browserhistoryback7
urllength
forwardint
basket2
basket1
minbasket1ibasket2j
new1
93
new2
2932
92
329
maxdoubles
ladders
furthest
hi1
rolling
sided
pricing
highest-ranked
pencils
cost1
pens
utensil
pencil
pen
cost2
80ms
overwrite
40ms
throttled
throttle
adjacentpairsi
adjacentpairs
forgotten
repeatlimitedstring
minalength
repeatlimit
prefi
surprisingly
alien
vn
en
scope
scopes
expr
mult
lisp-like
syntax
modes
occurred
8-directionally
sits
examroom
leaveint
examroomint
countuniquecharss
countuniquecharst
125
lru
lrucacheint
evict
lrucache
shelfwidth
books
shelf
booksi
thicknessi
shelves
bookcase
